task_manager/app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
SELECT COUNT(*) FROM "tasks"
---
    def index
        @tasks = Task.all
        puts @tasks.count

INSERT INTO "tasks" ("description", "completed", "created_at", "updated_at", "user") VALUES (?, ?, ?, ?, ?)  [["description", "get vegetables"], ["completed", nil], ["created_at", "2022-03-23 22:00:23.030972"], ["updated_at", "2022-03-23 22:00:23.030972"], ["user", nil]]
---
    def create
        @task = Task.new(task_params)
        respond_to do |format|
            if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", 1], ["updated_at", "2022-03-23 22:11:05.425569"], ["id", 10]]
---
    def toggle
        @task = Task.find(params[:id])
        if @task
            @task.update(completed: params[:completed])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 10]]
---
    def destroy
        @task = Task.find(params[:id])
        @task.destroy()

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "go to market 1"], ["updated_at", "2022-03-23 22:44:03.873602"], ["id", 11]]
---
    def update
        @task = Task.find(params[:id])
        respond_to do |format|
            if @task.update(task_params)